src/InformationRegisters/Спец_РеестрGTIN/Спец_РеестрGTIN.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_РеестрGTIN</name>
  <comment>Регистр для хранения информации по типу сканируемого товара и GTIN</comment>
  <resources>
    <name>ТипМаркировки</name>
    <type>
      <types>EnumRef.Спец_ТипыМаркируемогоТовара</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>DefinedType.Спец_GTIN</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/Спец_ГенерацияЧтениеШтрихКода/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Тип маркировки по GTIN.
// 
// Параметры:
//  GTIN - ОпределяемыйТип.Спец_GTIN - GTIN позиции (14 символов)
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.Спец_ТипыМаркируемогоТовара
//
Функция ТипМаркировкиПоGTIN(Знач GTIN) Экспорт
	
	НаборЗаписей = РегистрыСведений.Спец_РеестрGTIN.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.GTIN.Установить(GTIN);
	
	НаборЗаписей.Прочитать();
	Возврат ?(НаборЗаписей.Количество() = 0,
			Перечисления.Спец_ТипыМаркируемогоТовара.ПустаяСсылка(),
			НаборЗаписей.Получить(0).ТипМаркировки);
	
КонецФункции

#КонецОбласти
